In [1]:
import pandas as pd

In [5]:
import numpy as np
from numpy.random import randn

In [6]:
df= pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [7]:
df

          W         X         Y         Z
A -1.122634  1.054428  0.153537  0.937381
B -1.717105 -0.745420  0.513263 -0.371643
C -0.930939  1.961611 -0.375491 -0.660506
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533 -0.441587 -0.554684

In [13]:
df['W']

A   -1.122634
B   -1.717105
C   -0.930939
D    0.601414
E    0.123808
Name: W, dtype: float64

In [15]:
df['X']

A    1.054428
B   -0.745420
C    1.961611
D    1.400265
E    0.456533
Name: X, dtype: float64

In [16]:
df['Y']

A    0.153537
B    0.513263
C   -0.375491
D    0.611178
E   -0.441587
Name: Y, dtype: float64

In [17]:
df['Z']

A    0.937381
B   -0.371643
C   -0.660506
D    0.048703
E   -0.554684
Name: Z, dtype: float64

In [21]:
df[['W','X']]

          W         X
A -1.122634  1.054428
B -1.717105 -0.745420
C -0.930939  1.961611
D  0.601414  1.400265
E  0.123808  0.456533

In [22]:
df[['Y','Z']]

          Y         Z
A  0.153537  0.937381
B  0.513263 -0.371643
C -0.375491 -0.660506
D  0.611178  0.048703
E -0.441587 -0.554684

In [24]:
type(df['W'])

pandas.core.series.Series

In [29]:
df.W

A   -1.122634
B   -1.717105
C   -0.930939
D    0.601414
E    0.123808
Name: W, dtype: float64

In [30]:
df.X

A    1.054428
B   -0.745420
C    1.961611
D    1.400265
E    0.456533
Name: X, dtype: float64

In [32]:
df.loc['A']

W   -1.122634
X    1.054428
Y    0.153537
Z    0.937381
Name: A, dtype: float64

In [34]:
df.iloc[0]

W   -1.122634
X    1.054428
Y    0.153537
Z    0.937381
Name: A, dtype: float64

In [35]:
df.loc[['A','B']]

          W         X         Y         Z
A -1.122634  1.054428  0.153537  0.937381
B -1.717105 -0.745420  0.513263 -0.371643

In [36]:
df.iloc[[0,1]]

          W         X         Y         Z
A -1.122634  1.054428  0.153537  0.937381
B -1.717105 -0.745420  0.513263 -0.371643

In [45]:
df['new']=df['X']+10

In [47]:
df

          W         X         Y         Z        new
A -1.122634  1.054428  0.153537  0.937381  11.054428
B -1.717105 -0.745420  0.513263 -0.371643   9.254580
C -0.930939  1.961611 -0.375491 -0.660506  11.961611
D  0.601414  1.400265  0.611178  0.048703  11.400265
E  0.123808  0.456533 -0.441587 -0.554684  10.456533

In [66]:
df.drop('new',axis=1,inplace=True)

In [67]:
df

          W         X         Y         Z
A -1.122634  1.054428  0.153537  0.937381
B -1.717105 -0.745420  0.513263 -0.371643
C -0.930939  1.961611 -0.375491 -0.660506
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533 -0.441587 -0.554684

In [68]:
df.drop('A',axis=0,inplace=True)

In [70]:
df

          W         X         Y         Z
B -1.717105 -0.745420  0.513263 -0.371643
C -0.930939  1.961611 -0.375491 -0.660506
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533 -0.441587 -0.554684

In [71]:
df>0

       W      X      Y      Z
B  False  False   True  False
C  False   True  False  False
D   True   True   True   True
E   True   True  False  False

In [72]:
df[df>0]

          W         X         Y         Z
B       NaN       NaN  0.513263       NaN
C       NaN  1.961611       NaN       NaN
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533       NaN       NaN

In [73]:
df[df['W']>0]

          W         X         Y         Z
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533 -0.441587 -0.554684

In [75]:
df[df['W']>0]['Y']

D    0.611178
E   -0.441587
Name: Y, dtype: float64

In [78]:
df[df['W']>0][['Y','X']]

          Y         X
D  0.611178  1.400265
E -0.441587  0.456533

In [81]:
df[(df['W']>0)&(df['Y']>0)]

          W         X         Y         Z
D  0.601414  1.400265  0.611178  0.048703

In [83]:
df[(df['W']>0)&(df['Z']>0)]

          W         X         Y         Z
D  0.601414  1.400265  0.611178  0.048703

In [84]:
df[df['X']>0]

          W         X         Y         Z
C -0.930939  1.961611 -0.375491 -0.660506
D  0.601414  1.400265  0.611178  0.048703
E  0.123808  0.456533 -0.441587 -0.554684

In [86]:
df[df['X']>0][['W','Z']]

          W         Z
C -0.930939 -0.660506
D  0.601414  0.048703
E  0.123808 -0.554684

In [89]:
df[(df['X']>0)&(df['Z']>0)]

          W         X         Y         Z
D  0.601414  1.400265  0.611178  0.048703